---
kind: type
id: T:Autodesk.Revit.DB.ResourceVersionStatus
source: html/d9fae98e-e39a-9b69-07b9-b77cb777800c.htm
---
# Autodesk.Revit.DB.ResourceVersionStatus

An enum indicating whether a resource is current or out of date.

## Syntax (C#)
```csharp
public enum ResourceVersionStatus
```